{
  "name": "Manan Batra",
  "title": "Full Stack Web Developer",
  "summary": "Full Stack Web Developer specializing in the MERN stack (MongoDB, Express, React, Node.js). Experienced in designing and delivering scalable, user-focused web applications. Skilled in building dynamic interfaces, engineering robust backends, and ensuring seamless full-stack functionality. Demonstrated ability to collaborate in team environments, implement best coding practices, and deliver high-quality solutions that drive user engagement and satisfaction. Experienced in resolving technical challenges, collaborating in cross-functional teams, and consistently delivering projects on time while adapting to fast-paced environments.",
  "contact": {
    "email": "mananbatra1946@gmail.com",
    "phone": "+91-9813345151",
    "location": "India",
    "linkedin": "https://www.linkedin.com/in/mananbatra1/",
    "github": "https://github.com/manan-b"
  },
  "skills": {
    "languages": [
      "HTML5",
      "CSS3",
      "JavaScript",
      "C++",
      "SQL"
    ],
    "frameworks": [
      "React.js",
      "Tailwind CSS",
      "Material UI",
      "Framer Motion",
      "GSAP",
      "Three.js",
      "Lucide React"
    ],
    "backend": [
      "Node.js",
      "Express.js",
      "MongoDB",
      "REST APIs"
    ],
    "tools": [
      "Git",
      "GitHub",
      "Postman",
      "VS Code",
      "MySQL",
      "Vercel"
    ]
  },
  "experience": [
    {
      "company": "EOXS",
      "title": "Software Developer Intern",
      "period": "Jan 2025 – July 2025",
      "highlights": [
        "Developed and deployed a full-stack Grievance Assistant with ticket-based tracking and AI analytics, improving efficiency by 25%.",
        "Automated weekly reporting with Selenium and cron jobs, reducing manual effort by 80%.",
        "Implemented CI/CD pipelines for seamless deployments and developed a QR-based event system."
      ]
    },
    {
      "company": "Wiperspray",
      "title": "Full-Stack Web Developer",
      "period": "May 2024 – Jan 2025",
      "highlights": [
        "Collaborated with the core product team to design and develop responsive web applications across User, Client, and Admin platforms, reducing user wait times by 20–30% through optimized full-stack flows.",
        "Gained hands-on experience with the MERN stack (MongoDB, Express, React, Node.js), building scalable, reusable components and robust APIs.",
        "Worked on integrating backend APIs with frontend interfaces to improve state management, delivering a smoother and more seamless user experience."
      ]
    },
    {
      "company": "Chegg India",
      "title": "Subject Matter Expert",
      "period": "Sept 2023 – May 2024",
      "highlights": [
        "Delivered 200+ academic solutions across Computer Science subjects, improving student comprehension by 25%.",
        "Created and reviewed 100+ structured study materials aligned with curriculum standards.",
        "Increased course satisfaction ratings by 30% and supported higher completion rates through clear explanations."
      ]
    }
  ],
  "projects": [
    {
      "name": "ViewTube ~ YouTube Clone",
      "description": "Implemented real-time video streaming with API integration and optimized data fetching, resulting in 30% faster load times and improved user retention by 40%. Developed responsive UI with Tailwind CSS, ensuring accessibility compliance and increasing cross-device compatibility by 25%.",
      "bullets": [
        "Built a YouTube clone with video streaming and API integration",
        "Achieved 30% faster load times through optimized data fetching",
        "Improved user retention by 40% with enhanced UX design",
        "Developed responsive UI with Tailwind CSS for cross-device compatibility"
      ],
      "image": "/project-viewtube.png",
      "technologies": [
        "HTML5",
        "CSS3",
        "JavaScript",
        "React",
        "Tailwind",
        "API",
        "Node",
        "MongoDB",
        "Netlify"
      ],
      "github": "https://github.com/manan-b",
      "link": "https://viewstube.netlify.app/"
    },
    {
      "name": "Movie Recommendation System",
      "description": "Designed and deployed a high-performance movie recommendation API, cutting server response time by 50% through backend optimizations. Developed advanced predictive models that improved recommendation accuracy by 30%.",
      "bullets": [
        "Built a high-performance movie recommendation system with advanced algorithms",
        "Reduced server response time by 50% through backend optimizations",
        "Improved recommendation accuracy by 30% using predictive models",
        "Integrated RESTful APIs for seamless data exchange"
      ],
      "image": "/project-filmfizz.png",
      "technologies": [
        "HTML",
        "CSS",
        "JavaScript",
        "Tailwind",
        "API",
        "React",
        "Express",
        "Node",
        "MongoDB"
      ],
      "github": "https://github.com/mananbatra1946/Film-Fizz",
      "link": "https://film-fizz.netlify.app/"
    },
    {
      "name": "Portfolio Website",
      "description": "A personal portfolio website designed to showcase skills, projects, and experience. Built with React and Tailwind CSS for a modern, responsive look.",
      "bullets": [
        "Designed and developed a modern portfolio website to showcase projects and skills",
        "Built with React and Tailwind CSS for responsive design",
        "Integrated Framer Motion for smooth animations and transitions"
      ],
      "image": "/project-portfolio.png",
      "technologies": [
        "React",
        "Tailwind CSS",
        "Framer Motion",
        "Vite",
        "JavaScript",
        "HTML",
        "CSS"
      ],
      "github": "https://github.com/manan-b/My-Portfolio",
      "link": "https://manan-b.github.io/My-Portfolio/"
    }
  ],
  "education": [
    {
      "institution": "Chandigarh University",
      "degree": "B.E. Computer Science",
      "period": "Sept 2021 – June 2025",
      "score": "CGPA: 76.10%"
    },
    {
      "institution": "National Public School",
      "degree": "Intermediate School",
      "period": "Mar 2020 – Mar 2021",
      "score": "Percentage: 88.40%"
    },
    {
      "institution": "Little Angels School, Sonipat",
      "degree": "High School",
      "period": "Mar 2018 – Mar 2019",
      "score": "Percentage: 89.40%"
    }
  ]
}